open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_saradc.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_saradc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 SARADC - NuttX adc_dev_s lower-half wrapper.
 *
 * Wraps the official Beken bk_adc_* SDK API in a NuttX ADC lower half.
 * The BK7258 SARADC is a successive-approximation converter with channels
 * ADC_0..ADC_15.  This AP lower half talks to the CP-owned ADC controller
 * through the official v3.1.1.9 SARADC mailbox service.
 *
 * SDK call mapping (synchronous triggered conversion on the AP side):
 *   ao_bind()    -> stash the upper-half adc_callback_s
 *   ao_setup()   -> bk_adc_chan_init_gpio(chan)
 *   ao_shutdown()-> bk_adc_chan_deinit_gpio(chan)
 *   ao_rxint()   -> no-op (the CP SDK owns the conversion IRQ/semaphore)
 *   ao_ioctl()   -> ANIOC_TRIGGER:
 *                   acquire/init/config/start/read/stop/deinit/release, then
 *                   cb->au_receive(dev, chan, raw)
 *
 * SDK semantics (verified in saradc_client.c):
 *   - Every AP bk_adc_* API performs a mailbox IPC round trip against the CP
 *     SARADC server.  The matching CP profile owns server bring-up.
 *   - External-channel GPIO mapping is separate from bk_adc_init().
 *   - The AP bk_adc_single_read() request is absent from the CP server's
 *     command dispatcher.  The supported bk_adc_read() path waits for the
 *     SDK's 32-sample buffer and returns the average of its latter half.
 *   - CP ownership is held only during a conversion, allowing temperature
 *     sampling and other clients to make progress between triggers.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_SARADC

#include <errno.h>
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/cache.h>
#include <nuttx/mutex.h>

#include <arch/chip/bk7258_saradc.h>

#include <driver/adc.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_BK7258_SARADC_BUS
#  define CONFIG_BK7258_SARADC_BUS      0
#endif

#ifndef CONFIG_BK7258_SARADC_CHAN
#  define CONFIG_BK7258_SARADC_CHAN     0
#endif

#ifndef CONFIG_BK7258_SARADC_READ_TIMEOUT_MS
#  define CONFIG_BK7258_SARADC_READ_TIMEOUT_MS 1000
#endif

#define BK7258_SARADC_REFERENCE_CLK       0x0030a0c5u
#define BK7258_SARADC_REFERENCE_STEADY    7u

/* adc_config_t crosses the AP/CP SDK archive boundary.  Both v3.1.1.9
 * archives use the ARM EABI small-enum layout.  Fail the build instead of
 * silently sending a differently laid-out command if toolchain flags or the
 * imported SDK contract ever change.
 */

_Static_assert(sizeof(adc_config_t) == 36,
               "unexpected v3.1.1.9 adc_config_t size");
_Static_assert(offsetof(adc_config_t, adc_mode) == 16,
               "unexpected adc_config_t.adc_mode offset");
_Static_assert(offsetof(adc_config_t, src_clk) == 17,
               "unexpected adc_config_t.src_clk offset");
_Static_assert(offsetof(adc_config_t, chan) == 18,
               "unexpected adc_config_t.chan offset");
_Static_assert(offsetof(adc_config_t, saturate_mode) == 19,
               "unexpected adc_config_t.saturate_mode offset");
_Static_assert(offsetof(adc_config_t, vol_div) == 34,
               "unexpected adc_config_t.vol_div offset");

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_saradc_priv_s
{
  struct adc_dev_s dev;                 /* NuttX ADC lower-half anchor */
  FAR const struct adc_callback_s *cb;  /* Upper-half callbacks (ao_bind) */
  mutex_t lock;                         /* Serialize TRIGGER ioctls */
  uint8_t chan;                         /* SARADC channel (ADC_x) */
  bool bound;                           /* cb set? */
  bool gpio_mapped;                     /* Channel owns its analog pin */
  bool faulted;                         /* Cleanup failed; reboot required */
  bool release_uncertain;               /* Never retry an ambiguous unlock */
  int setup_error;                      /* Deferred ao_setup() failure */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_saradc_bind(FAR struct adc_dev_s *dev,
                              FAR const struct adc_callback_s *callback);
static void bk7258_saradc_reset(FAR struct adc_dev_s *dev);
static int bk7258_saradc_setup(FAR struct adc_dev_s *dev);
static void bk7258_saradc_shutdown(FAR struct adc_dev_s *dev);
static void bk7258_saradc_rxint(FAR struct adc_dev_s *dev, bool enable);
static int bk7258_saradc_ioctl(FAR struct adc_dev_s *dev, int cmd,
                               unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct adc_ops_s g_bk7258_saradc_ops =
{
  .ao_bind      = bk7258_saradc_bind,
  .ao_reset     = bk7258_saradc_reset,
  .ao_setup     = bk7258_saradc_setup,
  .ao_shutdown  = bk7258_saradc_shutdown,
  .ao_rxint     = bk7258_saradc_rxint,
  .ao_ioctl     = bk7258_saradc_ioctl,
};

static struct bk7258_saradc_priv_s g_bk7258_saradc =
{
  .dev.ad_ops = &g_bk7258_saradc_ops,
  .lock       = NXMUTEX_INITIALIZER,
  .chan       = (uint8_t)CONFIG_BK7258_SARADC_CHAN,
  .bound      = false,
  .gpio_mapped = false,
  .faulted    = false,
  .release_uncertain = false,
  .setup_error = OK,
};
static bool g_bk7258_saradc_registered;

volatile struct bk7258_saradc_diag_s g_bk7258_saradc_diag;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_saradc_bind
 *
 * Bind the upper-half callbacks.  Called before the device is opened.
 ****************************************************************************/

static int bk7258_saradc_bind(FAR struct adc_dev_s *dev,
                              FAR const struct adc_callback_s *callback)
{
  FAR struct bk7258_saradc_priv_s *priv =
    (FAR struct bk7258_saradc_priv_s *)dev;

  if (callback == NULL)
    {
      return -EINVAL;
    }

  priv->cb = callback;
  priv->bound = true;
  return OK;
}

/****************************************************************************
 * Name: bk7258_saradc_reset
 *
 * Nothing to reset: the SDK owns all SARADC hardware state and the IPC
 * service.  Kept as a no-op to satisfy the lower-half contract.
 ****************************************************************************/

static void bk7258_saradc_reset(FAR struct adc_dev_s *dev)
{
  (void)dev;
}

static void bk7258_saradc_diag_publish(void)
{
  __asm volatile ("dmb sy" ::: "memory");
  up_clean_dcache((uintptr_t)&g_bk7258_saradc_diag,
                  (uintptr_t)&g_bk7258_saradc_diag +
                  sizeof(g_bk7258_saradc_diag));
}

