open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_saradc.c
static int bk7258_saradc_map_error(bk_err_t error)
{
  /* The v3.1.1.9 AP mailbox client collapses every non-zero CP response and
   * every transport failure to BK_FAIL.  Do not claim a precision errno
   * which this side of the immutable wire contract cannot observe.
   */

  return error == BK_OK ? OK : -EIO;
}

static int bk7258_saradc_record_error(enum bk7258_saradc_stage_e stage,
                                      bk_err_t sdk_error)
{
  int error = bk7258_saradc_map_error(sdk_error);

  g_bk7258_saradc_diag.last_stage = stage;
  g_bk7258_saradc_diag.last_error = error;
  g_bk7258_saradc_diag.last_sdk_error = sdk_error;
  if (g_bk7258_saradc_diag.first_error == OK)
    {
      g_bk7258_saradc_diag.first_error = error;
      g_bk7258_saradc_diag.first_sdk_error = sdk_error;
    }
  return error;
}

static void bk7258_saradc_mark_fault(
  FAR struct bk7258_saradc_priv_s *priv)
{
  priv->faulted = true;
  g_bk7258_saradc_diag.state = BK7258_SARADC_STATE_FAULT;
}

static int bk7258_saradc_map_gpio_locked(
  FAR struct bk7258_saradc_priv_s *priv)
{
  bk_err_t cleanup_error;
  bk_err_t sdk_error;
  int ret;

  if (priv->faulted)
    {
      priv->setup_error = -EIO;
      return priv->setup_error;
    }

  if (priv->gpio_mapped)
    {
      priv->setup_error = OK;
      return OK;
    }

  g_bk7258_saradc_diag.resources |= BK7258_SARADC_RESOURCE_GPIO;
  sdk_error = bk_adc_chan_init_gpio((adc_chan_t)priv->chan);
  if (sdk_error != BK_OK)
    {
      ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_GPIO_MAP,
                                       sdk_error);
      cleanup_error = bk_adc_chan_deinit_gpio((adc_chan_t)priv->chan);
      if (cleanup_error == BK_OK)
        {
          g_bk7258_saradc_diag.resources &=
            ~BK7258_SARADC_RESOURCE_GPIO;
          g_bk7258_saradc_diag.gpio_unmap_count++;
        }
      else
        {
          (void)bk7258_saradc_record_error(
                  BK7258_SARADC_STAGE_GPIO_UNMAP, cleanup_error);
          bk7258_saradc_mark_fault(priv);
        }

      priv->setup_error = ret;
      return ret;
    }

  priv->gpio_mapped = true;
  priv->setup_error = OK;
  g_bk7258_saradc_diag.gpio_map_count++;
  g_bk7258_saradc_diag.state = BK7258_SARADC_STATE_READY;
  g_bk7258_saradc_diag.last_stage = BK7258_SARADC_STAGE_GPIO_MAP;
  return OK;
}

static int bk7258_saradc_cleanup_conversion(
  FAR struct bk7258_saradc_priv_s *priv)
{
  bk_err_t sdk_error;
  int error = OK;
  int ret;

  if ((g_bk7258_saradc_diag.resources &
       BK7258_SARADC_RESOURCE_STARTED) != 0)
    {
      sdk_error = bk_adc_stop();
      if (sdk_error == BK_OK)
        {
          g_bk7258_saradc_diag.resources &=
            ~BK7258_SARADC_RESOURCE_STARTED;
          g_bk7258_saradc_diag.stop_count++;
        }
      else
        {
          ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_STOP,
                                           sdk_error);
          if (error == OK)
            {
              error = ret;
            }
        }
    }

  /* Keep the CP ownership lock until every controller resource below it has
   * been released.  Retrying cleanup on last-close is safe only while this
   * client still owns the shared ADC mutex.
   */

  if ((g_bk7258_saradc_diag.resources &
       BK7258_SARADC_RESOURCE_STARTED) == 0 &&
      (g_bk7258_saradc_diag.resources &
       BK7258_SARADC_RESOURCE_INITED) != 0)
    {
      sdk_error = bk_adc_deinit((adc_chan_t)priv->chan);
      if (sdk_error == BK_OK)
        {
          g_bk7258_saradc_diag.resources &=
            ~BK7258_SARADC_RESOURCE_INITED;
          g_bk7258_saradc_diag.deinit_count++;
        }
      else
        {
          ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_DEINIT,
                                           sdk_error);
          if (error == OK)
            {
              error = ret;
            }
        }
    }

  if ((g_bk7258_saradc_diag.resources &
       (BK7258_SARADC_RESOURCE_STARTED |
        BK7258_SARADC_RESOURCE_INITED)) == 0 &&
      (g_bk7258_saradc_diag.resources &
       BK7258_SARADC_RESOURCE_ACQUIRED) != 0 &&
      !priv->release_uncertain)
    {
      sdk_error = bk_adc_release();
      if (sdk_error == BK_OK)
        {
          g_bk7258_saradc_diag.resources &=
            ~BK7258_SARADC_RESOURCE_ACQUIRED;
          g_bk7258_saradc_diag.release_count++;
        }
      else
        {
          /* The AP stub collapses both a CP-side failure and a lost reply
           * into BK_FAIL.  Reissuing release after a lost success could
           * unlock a later owner, so retain the ownership obligation and
           * require a CP/server reset rather than retrying it.
           */

          priv->release_uncertain = true;
          ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_RELEASE,
                                           sdk_error);
          if (error == OK)
            {
              error = ret;
            }
        }
    }

  if ((g_bk7258_saradc_diag.resources &
       (BK7258_SARADC_RESOURCE_ACQUIRED |
        BK7258_SARADC_RESOURCE_INITED |
        BK7258_SARADC_RESOURCE_STARTED)) != 0)
    {
      bk7258_saradc_mark_fault(priv);
    }
  else if (!priv->faulted)
    {
      g_bk7258_saradc_diag.state = priv->gpio_mapped ?
        BK7258_SARADC_STATE_READY : BK7258_SARADC_STATE_RESET;
    }

  return error;
}

/****************************************************************************
 * Name: bk7258_saradc_setup
 *
 * Claim the configured channel's analog pin for the duration of the open
 * session.  Controller ownership is deliberately deferred to each trigger.
 ****************************************************************************/

static int bk7258_saradc_setup(FAR struct adc_dev_s *dev)
{
  FAR struct bk7258_saradc_priv_s *priv =
    (FAR struct bk7258_saradc_priv_s *)dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      /* adc_open() currently commits its open count even when ao_setup()
       * fails.  Never return a negative value from this lower callback;
       * ANIOC_TRIGGER will still fail closed if the mutex remains unusable.
       */

