open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_saradc.c
      priv->setup_error = ret;
      return OK;
    }

  g_bk7258_saradc_diag.setup_count++;
  (void)bk7258_saradc_map_gpio_locked(priv);
  bk7258_saradc_diag_publish();
  nxmutex_unlock(&priv->lock);

  /* NuttX adc_open() currently commits ad_ocount even when ao_setup()
   * returns an error.  Keep the VFS/open lifecycle coherent and defer any
   * recorded map failure to the first ANIOC_TRIGGER, which retries the
   * mapping before it starts a conversion.
   */

  return OK;
}

/****************************************************************************
 * Name: bk7258_saradc_shutdown
 ****************************************************************************/

static void bk7258_saradc_shutdown(FAR struct adc_dev_s *dev)
{
  FAR struct bk7258_saradc_priv_s *priv =
    (FAR struct bk7258_saradc_priv_s *)dev;
  bk_err_t sdk_error;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      bk7258_saradc_mark_fault(priv);
      bk7258_saradc_diag_publish();
      return;
    }

  g_bk7258_saradc_diag.shutdown_count++;
  (void)bk7258_saradc_cleanup_conversion(priv);

  if (priv->gpio_mapped &&
      (g_bk7258_saradc_diag.resources &
       (BK7258_SARADC_RESOURCE_ACQUIRED |
        BK7258_SARADC_RESOURCE_INITED |
        BK7258_SARADC_RESOURCE_STARTED)) == 0)
    {
      sdk_error = bk_adc_chan_deinit_gpio((adc_chan_t)priv->chan);
      if (sdk_error == BK_OK)
        {
          priv->gpio_mapped = false;
          g_bk7258_saradc_diag.resources &=
            ~BK7258_SARADC_RESOURCE_GPIO;
          g_bk7258_saradc_diag.gpio_unmap_count++;
          g_bk7258_saradc_diag.last_stage =
            BK7258_SARADC_STAGE_GPIO_UNMAP;
        }
      else
        {
          (void)bk7258_saradc_record_error(BK7258_SARADC_STAGE_GPIO_UNMAP,
                                           sdk_error);
          bk7258_saradc_mark_fault(priv);
        }
    }

  if (g_bk7258_saradc_diag.resources == 0 && !priv->faulted)
    {
      priv->setup_error = OK;
      g_bk7258_saradc_diag.state = BK7258_SARADC_STATE_RESET;
    }

  bk7258_saradc_diag_publish();
  nxmutex_unlock(&priv->lock);
}

/****************************************************************************
 * Name: bk7258_saradc_rxint
 *
 * No-op: the SDK SARADC path is mailbox IPC / blocking, there is no
 * interrupt to enable or disable from this lower half.
 ****************************************************************************/

static void bk7258_saradc_rxint(FAR struct adc_dev_s *dev, bool enable)
{
  (void)dev;
  (void)enable;
}

/****************************************************************************
 * Name: bk7258_saradc_ioctl
 *
 * ANIOC_TRIGGER performs a single-shot conversion and pushes the raw
 * sample to the upper half via au_receive().
 ****************************************************************************/

static int bk7258_saradc_ioctl(FAR struct adc_dev_s *dev, int cmd,
                               unsigned long arg)
{
  FAR struct bk7258_saradc_priv_s *priv =
    (FAR struct bk7258_saradc_priv_s *)dev;
  uint16_t raw;
  bool deliver = false;
  adc_config_t config;
  bk_err_t sdk_error;
  int cleanup_error;
  int ret;
  irqstate_t flags;

  switch (cmd)
    {
      case ANIOC_TRIGGER:
        {
          if (priv->cb == NULL || !priv->bound)
            {
              return -EAGAIN;
            }

          ret = nxmutex_lock(&priv->lock);
          if (ret < 0)
            {
              return ret;
            }

          if (!priv->gpio_mapped)
            {
              ret = bk7258_saradc_map_gpio_locked(priv);
              if (ret < 0)
                {
                  goto trigger_out;
                }
            }

          if (priv->faulted)
            {
              ret = -EIO;
              goto trigger_out;
            }

          if (!priv->gpio_mapped)
            {
              ret = -EPIPE;
              goto trigger_out;
            }

          g_bk7258_saradc_diag.trigger_count++;
          g_bk7258_saradc_diag.state = BK7258_SARADC_STATE_CONVERTING;

          sdk_error = bk_adc_acquire();
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_ACQUIRE,
                                               sdk_error);
              bk7258_saradc_mark_fault(priv);
              goto trigger_cleanup;
            }

          g_bk7258_saradc_diag.resources |=
            BK7258_SARADC_RESOURCE_ACQUIRED;
          g_bk7258_saradc_diag.acquire_count++;

          /* Mark cleanup obligations before the init/start RPCs.  Their AP
           * stubs report the same BK_FAIL when the request failed and when
           * CP committed it but the reply was lost.  Both inverse calls are
           * safe while this client still owns the ADC mutex.
           */

          g_bk7258_saradc_diag.resources |=
            BK7258_SARADC_RESOURCE_INITED;
          sdk_error = bk_adc_init((adc_chan_t)priv->chan);
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_INIT,
                                               sdk_error);
              goto trigger_cleanup;
            }

          g_bk7258_saradc_diag.init_count++;

          /* bk_adc_init() resets the hardware control registers, including
           * the conversion mode.  Reapply the complete, zero-initialized
           * v3.1.1.9 reference configuration on every trigger because other
           * CP-side SARADC clients may have used a different channel/config
           * between conversions.
           */

          memset(&config, 0, sizeof(config));
          config.clk = BK7258_SARADC_REFERENCE_CLK;
          config.sample_rate = 0;
          config.adc_filter = 0;
          config.steady_ctrl = BK7258_SARADC_REFERENCE_STEADY;
          config.adc_mode = ADC_CONTINUOUS_MODE;
          config.src_clk = ADC_SCLK_XTAL_26M;
          config.chan = (adc_chan_t)priv->chan;
          config.saturate_mode = ADC_SATURATE_MODE_3;
          config.vol_div = ADC_VOL_DIV_NONE;

          sdk_error = bk_adc_set_config(&config);
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(
                      BK7258_SARADC_STAGE_CONFIG, sdk_error);
              goto trigger_cleanup;
            }

          g_bk7258_saradc_diag.config_count++;

          /* NuttX publishes raw ADC samples.  Match the official reference
           * path and bypass the hardware offset-calibration result.
           * bk_adc_init() resets this bit before every conversion.
           */

          sdk_error = bk_adc_enable_bypass_clalibration();
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(
                      BK7258_SARADC_STAGE_BYPASS_CALIBRATION, sdk_error);
              goto trigger_cleanup;
            }

