open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_saradc.c
          g_bk7258_saradc_diag.bypass_count++;

          g_bk7258_saradc_diag.resources |=
            BK7258_SARADC_RESOURCE_STARTED;
          sdk_error = bk_adc_start();
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_START,
                                               sdk_error);
              goto trigger_cleanup;
            }

          g_bk7258_saradc_diag.start_count++;

          sdk_error = bk_adc_read(&raw,
                        CONFIG_BK7258_SARADC_READ_TIMEOUT_MS);
          if (sdk_error != BK_OK)
            {
              ret = bk7258_saradc_record_error(BK7258_SARADC_STAGE_READ,
                                               sdk_error);
              goto trigger_cleanup;
            }

          g_bk7258_saradc_diag.sample_count++;
          g_bk7258_saradc_diag.last_raw = raw;
          if (g_bk7258_saradc_diag.sample_count == 1 ||
              raw < g_bk7258_saradc_diag.minimum_raw)
            {
              g_bk7258_saradc_diag.minimum_raw = raw;
            }

          if (g_bk7258_saradc_diag.sample_count == 1 ||
              raw > g_bk7258_saradc_diag.maximum_raw)
            {
              g_bk7258_saradc_diag.maximum_raw = raw;
            }

          deliver = true;
          ret = OK;

trigger_cleanup:
          cleanup_error = bk7258_saradc_cleanup_conversion(priv);
          if (ret == OK && cleanup_error < 0)
            {
              ret = cleanup_error;
              deliver = false;
            }

          if (ret == OK)
            {
              g_bk7258_saradc_diag.last_stage =
                BK7258_SARADC_STAGE_COMPLETE;
              g_bk7258_saradc_diag.last_error = OK;
              g_bk7258_saradc_diag.last_sdk_error = BK_OK;
            }

trigger_out:
          bk7258_saradc_diag_publish();
          nxmutex_unlock(&priv->lock);

          if (deliver)
            {
              int callback_error;

              /* This is the fixed NuttX ADC upper callback, not an
               * application callback.  Its FIFO producer path omits its own
               * spin lock, so take the public adc_dev_s lock to serialize
               * all synchronous producers against SMP readers and
               * poll/reset operations.  Do not retain the private mutex
               * across adc_notify(): poll notification and semaphore wakeup
               * are external upper-half paths and may schedule a caller that
               * immediately issues another ioctl.
               */

              flags = spin_lock_irqsave(&dev->ad_spinlock);
              callback_error =
                priv->cb->au_receive(dev, (uint8_t)priv->chan,
                                     (int32_t)raw);
              spin_unlock_irqrestore(&dev->ad_spinlock, flags);
              if (callback_error < 0)
                {
                  if (nxmutex_lock(&priv->lock) >= 0)
                    {
                      g_bk7258_saradc_diag.callback_error_count++;
                      g_bk7258_saradc_diag.last_stage =
                        BK7258_SARADC_STAGE_DELIVER;
                      g_bk7258_saradc_diag.last_error = callback_error;
                      g_bk7258_saradc_diag.last_sdk_error = BK_OK;
                      if (g_bk7258_saradc_diag.first_error == OK)
                        {
                          g_bk7258_saradc_diag.first_error = callback_error;
                          g_bk7258_saradc_diag.first_sdk_error = BK_OK;
                        }

                      bk7258_saradc_diag_publish();
                      nxmutex_unlock(&priv->lock);
                    }

                  return callback_error;
                }

              if (nxmutex_lock(&priv->lock) >= 0)
                {
                  g_bk7258_saradc_diag.deliver_count++;
                  bk7258_saradc_diag_publish();
                  nxmutex_unlock(&priv->lock);
                }
            }
        }
        break;

      default:
        ret = -ENOTTY;
        break;
    }

  (void)arg;
  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_saradc_initialize(void)
{
  int ret;

  if (g_bk7258_saradc_registered)
    {
      return OK;
    }

  memset((FAR void *)&g_bk7258_saradc_diag, 0,
         sizeof(g_bk7258_saradc_diag));
  g_bk7258_saradc_diag.magic = BK7258_SARADC_DIAG_MAGIC;
  g_bk7258_saradc_diag.version = BK7258_SARADC_DIAG_VERSION;
  g_bk7258_saradc_diag.size = sizeof(g_bk7258_saradc_diag);
  g_bk7258_saradc_diag.state = BK7258_SARADC_STATE_RESET;
  g_bk7258_saradc_diag.channel = CONFIG_BK7258_SARADC_CHAN;
  bk7258_saradc_diag_publish();

  ret = adc_register(CONFIG_BK7258_SARADC_DEVNAME, &g_bk7258_saradc.dev);
  if (ret >= 0)
    {
      g_bk7258_saradc_registered = true;
    }

  return ret;
}

int bk7258_saradc_get_diag(struct bk7258_saradc_diag_s *diag)
{
  int ret;

  if (diag == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_bk7258_saradc.lock);
  if (ret < 0)
    {
      return ret;
    }

  memcpy(diag, (FAR const void *)&g_bk7258_saradc_diag, sizeof(*diag));
  nxmutex_unlock(&g_bk7258_saradc.lock);
  return OK;
}

#endif /* CONFIG_BK7258_SARADC */
